["The scientific term for brain freeze is “sphenopalatine ganglioneuralgia”.",
"Canadians say “sorry” so much that a law was passed in 2009 declaring that an apology can’t be used as evidence of admission to guilt.",
"Back when dinosaurs existed, there used to be volcanoes that were erupting on the moon.",
"The only letter that doesn’t appear on the periodic table is J.",
"One habit of intelligent humans is being easily annoyed by people around them, but saying nothing in order to avoid a meaningless argument.",
"If a Polar Bear and a Grizzly Bear mate, their offspring is called a “Pizzy Bear”.",
"In 2006, a Coca-Cola employee offered to sell Coca-Cola secrets to Pepsi. Pepsi responded by notifying Coca-Cola.",
"There were two AI chatbots created by Facebook to talk to each other, but they were shut down after they started communicating in a language they made for themselves.",
"Nintendo trademarked the phrase “It’s on like Donkey Kong” in 2010.",
"Daniel Radcliffe was allergic to his Harry Potter glasses.",
"Rubber bands will last much longer when they are refrigerated.",
"There are 293 ways to make change for a dollar.",
"The Grand Theft Auto franchise has lawsuits that total over $1 billion.",
"All clocks in Pulp Fiction are set to 4:20.",
"The eye of an ostrich is bigger than its brain.",
"A dime has 118 ridges on its edge.",
"On average, a secretary will use its left hand for 56% of what they type on a keyboard.",
"The largest pair of eyes in the world belongs to the giant squid.",
"The Pokemon Rhydon was the first to ever be created.",
"Super Mario Land was the most popular game on the Game Boy during its release.",
"The dot over the small letter 'i' is called a title.",
"Japan has 23 vending machines per person.",
"Soccer balls were once used for playing basketball.",
"A candle’s flame is hot and blue in zero gravity.",
"Putting sugar on a cut will make it heal faster.",
"X-rays can’t detect real diamonds.",
"There are 7 different types of twins.",
"The national flag of Libya was formerly just the color green.",
"The plastic tips of shoelaces are called aglets.",
"Sign language has tongue twisters.",
"Penguins fly underwater.",
"Minnie the Mouse’s first name is not Minnie.",
"Rudolph the Reindeer is female.",
"A jiffy is a proper unit of time.",
"April 11, 1954, was recorded as the most boring day in the world.",
"Tiramisu translates to ‘take me to heaven’ in Italian.",
"Buttermilk does not contain any butter.",
"Brunch was invented as a way of curing hangovers.",
"Hitler’s nephew betrayed him.",
"The continental plates move at the same rate that fingernails grow.",
"Sailors working for the Royal Navy need special permission to grow their beards.",
"There are fewer stars than there are trees on Earth.",
"Mary and James are the most popular names around the world.",
"Children are born less frequently on Saturdays.",
"Danish mothers are known to be the most hardworking moms in the world.",
"75 burgers are sold in McDonald’s every second.",
"1,700 people become millionaires every day in the U.S.",
"You can’t hum while holding your nose.",
"You are more likely to have a weird or scary dream when sleeping on your stomach.",
"Your eyeballs do not grow or change their size as you age.",
"Blue-eyed people have higher alcohol tolerance.",
"Pubic hair lives for about 3 weeks long.",
"Male bees can only mate once.",
"Smelling green apples help with weight loss.",
"A snail has 2,500 teeth.",
"You can die from staying up for two weeks straight.",
"Pigeons can't fart.",
"Space partly smells like diesel fuel and barbeque.",
"One strand of hair can hold up to 3 ounces of weight.",
"Watching horror movies before viewing abstract art will enhance the experience.",
"Children’s book author, Roald Dahl was a spy.",
"NASCAR drivers lose weight while racing.",
"Indians read the most in the world.",
"Cap'n Crunch was once sued for not using real berries.",
"Cap'n Crunch's full name is Horatio Magellan Crunch.",
"The most widely printed book in the world is the catalog for IKEA.",
"Crocodiles are one of the planet’s oldest living creatures.",
"The Aurora Borealis has a sister phenomenon.",
"The salty taste of bacon isn’t natural.",
"There was a fifth member of the Beatles.",
"Apple once had a clothing line.",
"3 Musketeer chocolate bars used to have 3 flavors.",
"You cannot crack your knuckles.",
"The bones of the human body can multiply in density.",
"Your funny bone is a nerve.",
"A french pig was executed for killing a child.",
"Pineapples are named after pinecones.",
"Scotland has over 400 words to refer to snow.",
"There are more than 200 flavors of Kit Kat in Japan.",
"New Zealand was once auctioned on eBay.",
"There is a city in Oregon called Boring.",
"Leeches were used to predict the weather.",
"The ‘?!’ punctuation mark has a term.",
"Only owning one guinea pig is illegal in Switzerland.",
"A man in Florida once threw a live alligator through a drive-thru window.",
"Great Britain once had a number where you can report rogue traffic cones.",
"The largest recorded snowflake is 15 inches wide.",
"McDonald’s once had bubblegum flavored broccoli.",
"American Airlines saved money by getting rid of olives from their meals.",
"‘OMG’ was first used in a letter to Winston Churchill in 1917.",
"Sailors consider black cats good luck.",
"A janitor invented the flaming hot Cheetos.",
"North Korean teachers were required to play the accordion.",
"Melting glaciers make fizzy noises.",
"Male students attending Brigham Young University cannot grow beards.",
"A pistol can only be used by one hand.",
"Black taxis in London are tall for a reason.",
"Flipping a shark will render it temporarily immobile.",
"The largest living organism is an aspen grove.",
"Someone will write and recite a poem at your funeral if you die in the Netherlands.",
"Alan Shepard played golf on the moon.",
"Ioannis Ikonomou has been the chief translator of the European Parliament since 2002.",
"Kummerspeck is German for the weight gained during emotional eating.",
"SEARS once sold houses.",
"An encrypted monument stands outside of the CIA headquarters in Virginia.",
"Cold water is just as cleansing as hot water.",
"David Bowie helped topple the Berlin wall.",
"Tap water in Manhattan is not Kosher.",
"A park ranger from the U.S was once hit by lightning 7 times.",
"The fedora was originally a hat made for women.",
"The story of Beauty and the Beast was aimed to make women open to arranged marriages.",
"Timothy Leary escaped prison.",
"Bottled water has an expiration date.",
"Many pets from the U.S run away on July 4th.",
"Queen Elizabeth cannot sit on the Iron Throne.",
"Incan people used knots to keep track of records.",
"Monty Python has one of the most requested songs for funerals in England.",
"The state of Virginia may contain hidden treasure.",
"Fake ambulances are hired in Russia by the wealthy.",
"Most businesses do not see the practicality of having diaper tables.",
"The world’s most successful pirate was a woman.",
"The KKK was taken down with help from Superman.",
"The Baseball Hall of Fame had a secret inductee.",
"Milk wagons are the reason why we have roadway lines.",
"The most successful predator is a wild dog.",
"A man was once saved by a sea lion.",
"Saliva can be used to monitor alcohol intake.",
"The world’s largest pyramid cannot be found in Egypt.",
"Some pandas fake a pregnancy to get better healthcare.",
"Cacti come in many different colors other than green.",
"The inventor of the frisbee became a frisbee himself.",
"Dolphins have names.",
"One species of ants can only be found in Manhattan, New York.",
"Around 30,000 rubber ducks were lost at sea in 1992.",
"Charles Darwin’s pet turtle outlived him.",
"Losing weight alters brain activity.",
"The folds in a chef’s hat represents the number of ways you can cook an egg.",
"Cactus spines can be used to make hooks.",
"Depending on how they descend, waterfalls have different classifications.",
"Neil Armstrong never said ‘That's one small step for man’.",
"The odds of getting a royal flush is 1 in 649,740.",
"Driving south from Detroit will lead to Canada.",
"More people speak English as their second language than those who use it as their mother tongue.",
"Sleep deprivation makes it harder to lose weight.",
"The world’s largest single drop waterfall is the Kaieteur Falls.",
"Your teeth are unique.",
"The most popular state bird is the Northern cardinal.",
"Triskaidekaphobia is the fear of the number 13.",
"A single dollar bill costs 5 cents to make.",
"Baby sea otters are unable to swim.",
"Snakes can predict earthquakes.",
"The King of Hearts is the only King without a mustache.",
"Only two diseases have been completely eradicated.",
"The only English word that ends with ‘mt’ is Dreamt.",
"May 29th is Put a Pillow on Your Fridge Day.",
"The opposite sides of dice will always equal 7.",
"The metal studs found on denim jeans serve a particular purpose.",
"The average adult spends more time on the toilet than exercising.",
"About 7% of American adults believe chocolate milk comes from brown cows.",
"Cats can't taste sweet flavors.",
"Bananas get their curved shape by growing towards the sun.",
"Your fingernails on your dominant hand grow faster.",
"Apple seeds contain cyanide.",
"Frigate birds can sleep while flying.",
"Only one capital in the U.S has no McDonald’s.",
"People used to answer the phone with “ahoy”.",
"Playing dance music helps ward off mosquitoes.",
"Billy goats urinate on their heads to become more attractive.",
"Movie trailers were originally shown after the movie.",
"Among all the Disney princesses, Mulan has the highest kill count.",
"Pinocchio cannot say ‘my nose will grow now’.",
"You are 13.8% more likely to die on your date of birth.",
"Alaska is the only state whose name is on a single row on the keyboard.",
"Many oranges are green.",
"Vantablack has a trademark.",
"A man once set a record by putting on over 260 t-shirts.",
"Queen Elizabeth is a trained mechanic.",
"Optical illusions can be found at the bottom of the sea.",
"123456 is the most common password.",
"The average American spends 2.5 days annually looking for lost items.",
"Technicolored squirrels roam the lands of Southern India.",
"Basenji dogs can't bark.",
"Dragonflies can’t walk.",
"Space travel makes mice run in circles.",
"The chicken is the closest relative to the T-Rex.",
"Two-thirds of millennials go to sleep naked.",
"Sloths hold their breaths longer than dolphins.",
"More monopoly money is printed annually rather than actual currency.",
"‘Schoolmaster’ is an anagram of ‘the classroom’.",
"Ravens are always aware when someone is watching them.",
"An eagle is capable of killing a young deer and flying away with it.",
"Baby spiders are called spiderlings.",
"A palindrome is a sentence that is the same when read backward and forwards.",
"The roar of a lion can be heard up to 5 miles away.",
"The average male will become bored after 26 minutes of shopping.",
"The U.S. Navy uses Xbox controllers for their periscopes.",
"There is a species of spider dubbed the ‘hobo spider’.",
"Baby octopuses are the size of a flea.",
"The premiere of the TV reality show ‘16 and pregnant’ helped lower the rate of teen pregnancy.",
"Up to 20% of power outages in the U.S are due to squirrels.",
"95% of people text things that they would never say in person.",
"The Mayo Clinic made glow in the dark cats while trying to find a cure for AIDS.",
"The Antarctic glaciers are made up of 3% penguin urine.",
"Facebook, Instagram, and Twitter are banned in China.",
"Honeybees can recognize human faces.",
"The happiest prisoner on death row had an IQ of 46.",
"Violin bows are made from horsehair.",
"IKEA is an acronym.",
"Stephen Hawking held a reception for time travelers in 2009.",
"A Norwegian Island made dying illegal.",
"People who post their fitness routine on social media are more likely to have psychological problems.",
"Dr Pepper does not have a period.",
"There is an underwater version of rugby.",
"You can burn calories just by standing.",
"Mice typically only live for 6 months in the wild.",
"The backward punctuation mark is used to identify sarcasm.",
"If a body is too obese, it can cause complications when being cremated.",
"Flossing your teeth improves memory.",
"A common souvenir people bring from the U.S are red solo cups.",
"St. Lucia is the only country that is named after a woman.",
"Ben & Jerry’s made a graveyard for their former flavors.",
"Pluto was one temporarily closer to the sun than Neptune.",
"About $3.70 is given to an American child per tooth they lose.",
"There is a scientific term for brain freezes.",
"Only one letter in the English alphabet cannot be found on the periodic table.",
"The calling shotgun for the front passenger seat comes from a messenger.",
"A single strand of spaghetti is individually referred to as spaghetto.",
"Pointing your car keys to your head helps you find your car faster.",
"The fat Buddha statue and in pictures is not Buddha himself.",
"A jockey from 1923 managed to finish a race after dying.",
"The largest prime number has 17,425,170 digits.",
"The largest grand piano in the world was built by a teenager.",
"A Polish doctor once faked an outbreak to keep the Nazi’s away.",
"The 1996 film called Scream increased the usage of caller IDs in the U.S.",
"The spiked dog collars are meant to protect their necks from attacks.",
"Jack Daniels died from a toe injury.",
"The boss in Metal Gear Solid 3 takes a week to beat.",
"The correct English translation for Jesus is Joshua.",
"The first service animals were established in Germany.",
"The planet was named Pluto thanks to an 11-year-old girl.",
"Around 50% of the mined gold on Earth comes from one source.",
"12 plants and 5 animals make up 75% of diets around the world.",
"Shakira was rejected from her elementary choir group.",
"Minnesota has the world’s quietest room.",
"The Japanese have its own word for book hoarders.",
"Every decade, brain fibers lose 10% of their strength.",
"The happiest countries in the world have the highest antidepressant consumers.",
"The official language of Ireland is not the most spoken in the country.",
"Sourtoe cocktails are served in Yukon.",
"The release of Pokemon GO increased game-related accidents by 26.5%.",
"Mexican prisons do not punish you for non-violent attempts to escape.",
"A BBC radio announcer once stated that they did not have any news.",
"Starfishes do not have blood.",
"The most mathematical flag in the world belongs to Nepal.",
"It did not take more than $1M to build Mt. Rushmore.",
"Samsung translates to ‘three stars’ in Korean.",
"Geckos eat the skin they shed.",
"The U.S. government issued Santa Claus a pilot’s license.",
"Polar bears charge at a group of walruses while hunting.",
"You are able to become less depressed if you stay up.",
"Adult cats will only meow at humans.",
"There are more possible arrangements in shuffling a deck of cards than there are stars in the sky.",
"Therapy has been found to be least effective at battling depression compared to playing video games.",
"Bi-weekly has two connotations.",
"In 1911, the Mona Lisa was stolen from the Louvre.",
"The human vagina always holds a small amount of yeast.",
"Connecticut accidentally issued an Emergency Evacuation Alert in 2005.",
"Russians believe that eating ice cream will keep you warm.",
"Lemurs were one the size of gorillas.",
"Adding all the numbers on a roulette wheel will equivalent to 666.",
"The day after Thanksgiving is the busiest day for American plumbers.",
"Mount Everest is not the tallest mountain in our solar system.",
"Russell Horning is famous on the internet as the Backpack Kid.",
"The oldest currency in the world is the British pound.",
"The Great Pyramid of Giza has more than four sides.",
"The only innate fear we have at birth is the fear of falling and loud noises.",
"The average horse is capable of 746 watts of power.",
"The Leaning Tower of Pisa is tilted due to the soil at its base.",
"Slavery was once legal in Mauritania.",
"England and Portugal still maintain their alliance until today.",
"Garlic is known to attract leeches.",
"Uranus takes 84 years to orbit the sun.",
"A shape with 26 sides is known as a rhombicuboctahedron.",
"Applying equal pressure on an egg will prevent it from breaking.",
"There are over 6,000 species of grass.",
"The Earth holds about 11 quintillion pounds of air.",
"There is a term for a person that is perpetually afraid of being late.",
"The queens in ant colonies live for around 30 years.",
"The map size in GTA V is twice the actual size of Manhattan.",
"The paint on the Eiffel tower is equivalent to ten elephants.",
"The largest living thing on Earth is a tree.",
"You can fit about 400 grapevines in one acre of land.",
"Multiplying 1089 by 9 will give you the same numbers in reverse.",
"August 17th celebrates Black Cat Appreciation Day.",
"Eminem’s ‘Rap God’ holds the world record for the most words in a hit single.",
"A British scientist studying chocolate has her taste buds insured.",
"The Titanic included dogs as their passengers.",
"China has a series of underground tunnels.",
"Pitbulls are ranked as the most affectionate breed of dogs.",
"Tanning beds increase your risk of developing melanoma.",
"One of the cleanest dog breeds in the world are poodles.",
"Owls have specialized feathers.",
"The human brain uses 20% of the oxygen in your body.",
"Staying in a negative relationship can lower your immune system.",
"The insect population of the world is 1 billion times more than the world population.",
"People once believed that chewing on tree bark will keep your gums healthy.",
"Kangaroos never stop growing.",
"Red blood cells circulate your body at an amazing speed.",
"The flashes of light when you rub your eyes are called phosphenes.",
"Cordozar Calvin Broadus Jr. is Snoop Dog’s real name."]